Revit 2027 API
GeometryCreationUtilities.CreateSweptBlendGeometry Method
Overload List
Name | Description
CreateSweptBlendGeometry(Curve, IList<Double>, IList<CurveLoop>, IList<ICollection<VertexPair>>) |  Creates a solid by simultaneously sweeping and blending two or more closed planar curve loops along a single curve.
CreateSweptBlendGeometry(Curve, IList<Double>, IList<CurveLoop>, IList<ICollection<VertexPair>>, SolidOptions) |  Creates a solid by simultaneously sweeping and blending two or more closed planar curve loops along a single curve.
Top
See Also
Reference
GeometryCreationUtilities Class
Autodesk.Revit.DB Namespace